000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MAIN.
000300
000400 DATA DIVISION.
000500   WORKING-STORAGE SECTION.
000600   01 WS-CNT PIC 9(7) VALUE 0.
000700   01 WS-TTH PIC 9(7) VALUE 1000000.  
000800 PROCEDURE DIVISION.
000900    A-PARA.
001000    PERFORM B-PARA WITH TEST AFTER  UNTIL WS-CNT>WS-TTH.
001100    STOP RUN.
001200
001300    B-PARA.
001400    DISPLAY WS-CNT.
001500    ADD 1 TO WS-CNT.
